# Описание

## Дано задание
> Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Примеры ответов:
> [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
> [“1234”, “1567”, “-2”, “computer science”] → [“-2”]
> [“Russia”, “Denmark”, “Kazan”] → []

## Создание блок-схемы
Используйте программу для рисования блок-схем, например, `Draw.io` или `Lucidchart`.

## Создание кода

```sh
using System;

string[] Array;
Console.WriteLine("Введите массив строк через запятую");
string line = Console.ReadLine();
Array = line.Split(',');
var Result = new string[Array .Length];
var realSize = 0;
foreach (var value in Array )
{
    if (value.Length <= 3)
    {
        Result[realSize] = value;
        realSize++;
    }
}
Console.WriteLine("Новый массив:");
Console.WriteLine(string.Join(Environment.NewLine, Result, 0, realSize));
Console.ReadKey(true); 
```

1. Запрос размера массива строк у пользователя

2. Ввод данных пользователем и сохранение в массиве

3. Подсчет подходящих строк (длина не более 3 символов)

4. Выделение памяти под новый массив с подходящими строками

5. Заполнение нового массива подходящими строками

6. Вывод результатов 


